export const charactersIdList: Record<string, string> = {
  '10000003': '琴',
  '10000005': '旅行者',
  '10000006': '丽莎',
  '10000014': '芭芭拉',
  '10000015': '凯亚',
  '10000016': '迪卢克',
  '10000020': '雷泽',
  '10000021': '安柏',
  '10000022': '温迪',
  '10000023': '香菱',
  '10000024': '北斗',
  '10000025': '行秋',
  '10000026': '魈',
  '10000027': '凝光',
  '10000029': '可莉',
  '10000030': '钟离',
  '10000031': '菲谢尔',
  '10000032': '班尼特',
  '10000034': '诺艾尔',
  '10000035': '七七',
  '10000036': '重云',
  '10000037': '甘雨',
  '10000038': '阿贝多',
  '10000039': '迪奥娜',
  '10000041': '莫娜',
  '10000043': '砂糖',
  '10000044': '辛焱',
  '10000045': '罗莎莉亚',
  '10000046': '胡桃',
}

export const nicknameList: Record<string, string[]> = {
  琴: ['琴团长', '团长', '蒲公英骑士'],
  丽莎: ['丽莎姐姐'],
  旅行者: ['空', '荧', '爷', '主角', '主人翁', '冒险者'],
  芭芭拉: [],
  凯亚: ['冻起来吧'],
  迪卢克: ['卢姥爷', '在此宣判', '卢锅巴'],
  雷泽: ['卢皮卡'],
  安柏: [],
  温迪: ['巴巴托斯', '风神', '诶嘿', '卖唱的'],
  香菱: ['锅巴的召唤兽', '香师傅', '璃月厨子'],
  北斗: [],
  行秋: [],
  魈: ['打桩机', '提瓦特打桩机', '快乐风男'],
  凝光: ['投石机'],
  可莉: ['哒哒哒', '逃跑的太阳', '火花骑士'],
  钟离: ['钟师傅', '岩神', '莫拉克斯'],
  菲谢尔: ['大幻梦森罗万象狂气断罪眼'],
  班尼特: ['倒霉蛋', '点赞哥', '命运试金石'],
  诺艾尔: ['女仆', '未授勋之花'],
  七七: ['77'],
  重云: [],
  甘雨: ['椰羊'],
  阿贝多: [],
  迪奥娜: ['dio娜'],
  莫娜: ['占星术士', '穷光蛋'],
  刻晴: ['刻师傅', '斩尽牛杂', '玉衡星', '屁斜剑法'],
  砂糖: [],
  辛焱: [],
  罗莎莉亚: ['修女'],
  胡桃: [''],
}

export function getCharacterByNickname(keyword: string): string {
  keyword = keyword.toLowerCase()
  const characters: string[] = Object.keys(nicknameList)
  if (characters.includes(keyword)) return keyword
  characters.forEach((item) => {
    if (nicknameList[item].includes(keyword)) return item
  })
  return keyword
}
